translations = {


    # _____________HANDLERS____________


    "start_message": {
        "uk": "Ласкаво просимо до бота MiningGear!"
              "\n\n💡 Тут ви можете задати будь-яке питання, що вас цікавить"
              "\n💡 Закупити обладнання"
              "\n💡 Дізнайтеся актуальні ціни на обладнання",

        "ru": "Тебя приветствует бот MiningGear!"
              "\n\n💡 Здесь ты можешь задать любой интересующий вопрос"
              "\n💡 Приобрести оборудование"
              "\n💡 Узнать актуальные цены на оборудование",

        "en": "Welcome to the MiningGear bot!"
              "\n\n💡 Here you can ask any question you are interested in"
              "\n💡 Purchase equipment"
              "\n💡 Find out the current prices for equipment",

        "kz": "MiningGear ботына қош келдіңіздер!"
              "\n\n💡 Мұнда сізді қызықтыратын кез келген сұрақты қоюға болады"
              "\n💡 Жабдықтар сатып алу"
              "\n💡 Жабдықтың ағымдағы бағасын анықтау",
    },

    "message_to_manager": {
        "uk": "<b><i>Найприбутковіші майнери на сьогоднішній день:</i></b>"
              "\n\n<b>* Fluminer L1</b>"
              "\n<b>* IceRiver AE0 </b>"
              "\n<b>* IceRiver AE1 Lite </b>"
              "\n<b>* Goldshell AE-BOX II</b>"
              "\n<b>* Goldshell E-DG1M</b>"
              "\n\n<b><i>⬇️ Вибираємо обладнання ⬇️</i></b>",

        "ru": "<b><i>Самые доходные майнеры на сегодня:</i></b>"
              "\n\n<b>* Fluminer L1</b>"
              "\n<b>* IceRiver AE0 </b>"
              "\n<b>* IceRiver AE1 Lite </b>"
              "\n<b>* Goldshell AE-BOX II</b>"
              "\n<b>* Goldshell E-DG1M</b>"
              "\n\n<b><i>⬇️ Выбрать оборудование ⬇️</i></b>",

        "en": "<b><i>The most profitable miners today:</i></b>"
              "\n\n<b>* Fluminer L1</b>"
              "\n<b>* IceRiver AE0 </b>"
              "\n<b>* IceRiver AE1 Lite </b>"
              "\n<b>* Goldshell AE-BOX II</b>"
              "\n<b>* Goldshell E-DG1M</b>"
              "\n\n<b><i>⬇️ Choose ASIC ⬇️</i></b>",

        "kz": "<b><i>Бүгінгі күні ең тиімді кеншілер:</i></b>"
              "\n\n<b>* Fluminer L1</b>"
              "\n<b>* IceRiver AE0 </b>"
              "\n<b>* IceRiver AE1 Lite </b>"
              "\n<b>* Goldshell AE-BOX II</b>"
              "\n<b>* Goldshell E-DG1M</b>"
              "\n\n<b><i>⬇️ Жабдықты таңдау ⬇️</i></b>",
    },

    "price_list": {
        "uk": "Актуальний прайс-лист:",
        "ru": "Актуальный Price-List:",
        "en": "Current Price-List:",
        "kz": " Ағымдағы баға-тізім:",
    },

    "our_site": {
        "uk": "Наш сайт:",
        "ru": "Наш сайт:",
        "en": "Our website:",
        "kz": " Біздің веб-сайт",
    },

    "message_to_support_successful": {
        "uk": "✅ Ваше повідомлення відправлено до служби підтримки.\n\nМи відповімо, як тільки зможемо!",
        "ru": "✅ Ваше сообщение отправлено в поддержку.\n\nОтветим как только сможем!",
        "en": "✅ Your message has been sent to support.\n\nWe will respond as soon as we can!",
        "kz": "✅ Сіздің хабарыңыз қолдауға жіберілді.\n\nБіз тез арада жауап береміз!",
    },

    "changed_language": {
        "uk": "✅ Мову змінено!",
        "ru": "✅ Язык изменён!",
        "en": "✅ The language has been changed!",
        "kz": "✅ Тіл өзгерді!",
    },

    "support_answer": {
        "uk": "👨🏻‍💻 Підтримка:",
        "ru": "👨🏻‍💻 Поддержка:",
        "en": "👨🏻‍💻 Support:",
        "kz": "👨🏻‍💻 Қолдау:",
    },

    # _____________KEYBOARDS____________

    "choose_lang": {
        "uk": "Виберіть мову:",
        "ru": "Выберите язык:",
        "en": "Select Language:",
        "kz": "Тілді таңдау:",
    },

    "menu_buy": {
        "uk": "📦 Купити ASIC",
        "ru": "📦 Купить ASIC",
        "en": "📦 Buy ASIC",
        "kz": "📦 ASIC сатып алу",
    },
    "menu_price": {
        "uk": "🧾 Прайс-лист",
        "ru": "🧾 Прайс-лист",
        "en": "🧾 Price List",
        "kz": "🧾 Бағалар тізімі",
    },
    "menu_site": {
        "uk": "🖥 Наш сайт",
        "ru": "🖥 Наш сайт",
        "en": "🖥 Our website",
        "kz": "🖥 Біздің веб-сайт",
    },
    "menu_language": {
        "uk": "🌎 Зміна мови",
        "ru": "🌎 Смена языка",
        "en": "🌎 Changing the language",
        "kz": "🌎 Тілді өзгерту",
    },
    "menu_placeholder": {
        "uk": "Виберіть дію",
        "ru": "Выберите действие",
        "en": "Choose an action",
        "kz": "Әрекетті таңдау",
    },

    "open_site": {
        "uk": "➡️ Відкрити сайт",
        "ru": "➡️ Открыть сайт",
        "en": "➡️ Open website",
        "kz": "➡️ Веб-сайтты ашу",
    },

    "buy_asic": {
        "uk": "Купити ASIC",
        "ru": "Купить ASIC",
        "en": "Buy ASIC",
        "kz": "ASIC сатып алу",
    },

    "open_price_list": {
        "uk": "ВІДКРИВАТИ",
        "ru": "ОТКРЫТЬ",
        "en": "OPEN",
        "kz": "Ашу",
    },
}

LANGUAGES = {
    "uk": "🇺🇦 UK 🇺🇦",
    "ru": "🇷🇺 RU 🇷🇺",
    "en": "🇺🇸 EN 🇺🇸",
    "kz": "🇰🇿 KZ 🇰🇿",
}